---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElevationFailures.WarnElevSheet
source: html/f3dc7a57-2ad2-e6cd-a3d2-12aa0010f75b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElevationFailures.WarnElevSheet Property

An elevation symbol references views on more than one sheet. It will show a blank sheet reference. To show the
 correct references, use a separate elevation symbol for the views on each sheet.

## Syntax (C#)
```csharp
public static FailureDefinitionId WarnElevSheet { get; }
```